[
  {
    "title": "Shop by Tewo",
    "image": "./projectImages/shopbytewo.png",
    "description": " This an e-commerce project developed using React, Redux, Stripe payment, MongoDB, and Node.js. This web application offers a seamless shopping experience with features such as product browsing, cart management, and secure payments through Stripe integration. The project leverages React and Redux to create an interactive user interface, while MongoDB ensures efficient data storage and management. Node.js handles the server-side operations, enabling the application to handle concurrent user requests effectively. This app provides a reliable solution for online shopping needs.",
    "technologies": "ReactJS | Redux | NodeJS | MongoDB",
    "github": "https://github.com/Tewogbade/ecommerce-app",
    "deployed": "https://ecommerce-app-sandy.vercel.app/",
    "bgcolor": "#aac4a3",
    "id": "1"
  },
  {
    "title": "Delicious App",
    "image": "./projectImages/recipe-app.png",
    "technologies": "ReactJS | API | CSS",
    "description": "The app utilizes the Recipe API to furnish comprehensive recipe information, comprising both ingredients and instructions. Additionally, the app incorporates an array of filter options catering to diverse culinary cultures such as Italian, American, Thai, and Japanese cuisines. The application also offers a random recipe search feature, enhancing user experience by providing a convenient means of discovering new and exciting recipes.",
    "github": "https://github.com/Tewogbade/recipe-app",
    "deployed": "https://recipe-app-tewogbade.vercel.app/",
    "bgcolor": "#928490",
    "id": "2"
  },
  {
    "title": "Audiophile",
    "image": "./projectImages/audiophile.png",
    "description": "Audiophile is created to provide a platform for purchasing earphones, earbuds, and speakers online. Its goal is to enhance the shopping experience by incorporating interactive features and a modern technological touch, By leveraging these cutting-edge technologies, Audiophile website is able to deliver a responsive, feature-rich, and modern shopping experience to its users. The website is designed to be user-friendly and intuitive, with a sleek and contemporary interface that enhances the overall shopping experience..",
    "technologies": "ReactJS | NodeJS",
    "github": "https://github.com/Tewogbade/audiophile",
    "deployed": "https://audiophile-dun-beta.vercel.app/",
    "bgcolor": "#DBC1AD",
    "id": "3"
  },
  {
    "title": "Todo List App",
    "image": "./projectImages/todo.png",
    "technologies": "JS | HTML | CSS",
    "description": "The Todo List App project is a visually stunning task management application built using JavaScript with an animated user interface. It offers a straightforward yet powerful solution for organizing and storing all your to-do items through the use of local storage. With this intuitive app, you can ensure that every hour of your day is productive and efficient. It also allows you to keep track of all your essential appointments within a standard 9-5 workday.",
    "github": "https://github.com/Tewogbade/todo-list",
    "deployed": "https://todo-list-tewogbade.vercel.app/",
    "bgcolor": "#ABDFF1",
    "id": "4"
  },
  {
    "title": "Guess My Number",
    "image": "./projectImages/guess.PNG",
    "technologies": "JS | HTML | CSS",
    "description": "Guess My Number is a fun and interactive game that utilizes the basic principles of JavaScript. The game offers you the opportunity to guess a random number within 10 attempts, and your remaining chances will determine your final score. To enhance the competition, the game also saves the player's highest score.",
    "github": "https://github.com/Tewogbade/Guess-my-number-game",
    "deployed": "https://guess-my-number-game-eight.vercel.app/",
    "bgcolor": "#F4ED6E",
    "id": "5"
  },
  {
    "title": "Room",
    "image": "./projectImages/room.jpg",
    "technologies": "JS | HTML | CSS | Bootstrap",
    "description": "Room is a furniture and life style landing page that showcases the brand's main products with detailed descriptions, allowing customers to make informed and quick purchasing decisions. The sleek and modern design ensures a seamless browsing experience. Helpful resources such as customer reviews, product specifications, and frequently asked questions are also provided. Room's landing page instills confidence in potential buyers, helping them make informed decisions. Overall, the user-friendly landing page is designed to attract and retain customers, while enhancing the shopping experience.",
    "github": "https://github.com/Tewogbade/Room-web",
    "deployed": "https://room-web.vercel.app/",
    "bgcolor": "#CAB387",
    "id": "6"
  },

  {
    "title": "NASIMS Clone",
    "image": "./projectImages/nasim.jpg",
    "description": "This is replica of existing National Social Investment Management System (NASIMS) website design and content. This was achieved using HTML, CSS and Bootstrap",
    "technologies": "JS | HTML | CSS | Bootstrap",
    "github": "https://github.com/Tewogbade/Nasims-project",
    "deployed": "https://nasims-project.vercel.app/",
    "bgcolor": "#D1AFD3 ",
    "id": "7"
  },

  

  {
    "title": "Meet Landing Page",
    "image": "./projectImages/meet.jpeg",
    "technologies": "ReactJS | Bootstrap",
    "description": "GMeet is a social app landing page designed with React that can be use for booking meetings with your business partners and friends, as well as save personal notes.",
    "github": "https://github.com/Tewogbade/Meet-project",
    "deployed": "https://meet-react-eta.vercel.app/",
    "bgcolor": "#A0D3F9",
    "id": "8"
  }
  
]


